app/controllers/artists_controller.rb

SELECT  "preferences".* FROM "preferences"  ORDER BY "preferences"."id" ASC LIMIT 1
---
  def new
    unless Preference.first[:allow_create_artists]